
import { Suspense } from "react";
import CardSkeleton from "@/ui/CardSkeleton/cardSkeleton";
import CardContainer from "@/ui/CardContainer/cardContainer";

async function Mobiles() {

    return (
        <div className="w-[90%] m-auto sm:pt-20 pt-12">
            <div className="flex justify-between items-center py-2">
                <h1 className="py-4 lg:text-[28px] md:text-[24px] sm:text-[20px] text-[18px]">گوشی موبایل</h1>
            </div>
            <Suspense fallback={<CardSkeleton />}>
                <CardContainer />
            </Suspense>
            <div className="py-12 px-0">
                <h3>خرید گوشی موبایل</h3>
                <p>
                    خرید گوشی موبایل در عصر امروزی به یک خرید ضروری تبدیل شده که معمولا
                    برای تمامی افراد ممکن است اتفاق بیفتد. بر اساس سبک زندگی های متفاوت،
                    معمولا نیاز افراد از گوشی موبایل متفاوت از هم میباشد. بنابراین پیش از
                    خرید گوشی موبایل نیاز است که از مشخصات فنی و ویژگی گوشی های مد نظر خود
                    مطلع شوید. علاوه بر این، حین خرید موبایل نکاتی وجود دارد که لازم است
                    به آنها دقت کنید تا خریدی سودمند داشته باشید. در این مطلب از سایت توشه
                    من، روش های مختلف خرید گوشی را بررسی کردیم و ارزان ترین راه را به شما
                    پیشنهاد دادیم. از این رو در صورتی که قصد خرید گوشی موبایل برای خودتان
                    یا نزدیکان خود دارید، این مطلب میتواند به شما کمک کند که بهترین گوشی
                    را در بازه قیمتی مد نظر خود تهیه کنید. امروزه خرید گوشی موبایل نقش
                    بسیار مهمی در زندگی روزمره ما دارد. همه افراد دنیا امروزه در عصر
                    دیجیتال زندگی می کنند و نیاز اول هر فرد داشتن یک گوشی موبایل هوشمند
                    است. بین همه افراد و گوشی آنها وابستگی عجیبی شکل گرفته است، به طوری که
                    آن را به هیچ عنوان از خود جدا نمی کنند. برای خرید گوشی موبایل
                    فاکتورهای زیادی برای افراد وجود دارد که اولویت این فاکتورها برای هر
                    فرد متفاوت است. برند و قیمت گوشی موبایل از مهم‌ترین این فاکتورها
                    هستند. افراد از گوشی موبایل برای عکاسی، کارهای اداری، کارهای شخصی و
                    غیره استفاده می کنند. یکی دیگر از مهم‌ترین معیارهایی که برای گوشی‌ها
                    وجود دارد عمر باتری آن‌ها است.
                </p>
            </div>
        </div>
    );
}

export default Mobiles;